v2206/Projects/solverTests/pimpleTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myTestPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          1;

writeControl    adjustable;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii; // binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  true;

runTimeModifiable true;

maxCo           0.4;

maxDeltaT       1;

functions {}


// ************************************************************************* //
